The purpose of this function is to count the values or combination of values in an entire dataset or a subselection of the columns in a dataset. I have created this function because I couldn't find a pandas function that can count both missing and non-missing values while also looking at a combination of values (multiple columns)

In [18]:
from collections import Counter
import pandas as pd
import numpy as np

def tidy_count(df,columns=None):
    
    # Only look at the columns specified
    # look at all columns otherwise
    if columns != None:
        df = df[list(columns)]
    else:
        pass
    
    # Get a unique list of rows and the column names
    all_rows = df.values.tolist()
    col_names = df.columns.values

    # Unique rows as a list of lists and also a pandas dataframe
    unique_rows = [list(x) for x in set(tuple(x) for x in all_rows)]
    unique_rows_pd = pd.DataFrame(unique_rows,columns=col_names)

    # Find the index for each row
    row_keys = [ unique_rows.index(row) for row in all_rows]

    # Count occurences by index, convert to dictionary
    key_counts = dict(Counter(row_keys))

    # Create a pandas dataframe from the counts dictionary, sort by index
    key_count_ref = pd.DataFrame(index= list(key_counts.keys()),
            data= {'count': list(key_counts.values())}).sort_index()

    # Combine our original rows data with our 
    final_counts = pd.concat([unique_rows_pd,key_count_ref],axis=1).\
        sort_values('count',ascending=False)
    
    return(final_counts)

## Test

In [19]:
df1 = pd.DataFrame({'a' : [1,np.nan,1,1,1,np.nan], 'b': [1,1,2,1,np.nan,np.nan]})
df2 = pd.DataFrame({"b": [1,2], "c": ["blah","yadda"]})
df_combi = df1.merge(df2,how='left',on='b')

In [20]:
df_combi

     a    b      c
0  1.0  1.0   blah
1  NaN  1.0   blah
2  1.0  2.0  yadda
3  1.0  1.0   blah
4  1.0  NaN    NaN
5  NaN  NaN    NaN

In [21]:
tidy_count(df_combi)

     a    b      c  count
3  1.0  1.0   blah      2
0  NaN  1.0   blah      1
1  1.0  2.0  yadda      1
2  1.0  NaN    NaN      1
4  NaN  NaN    NaN      1

In [22]:
tidy_count(df_combi,'a')

     a  count
1  1.0      4
0  NaN      1
2  NaN      1

In [23]:
tidy_count(df_combi,['a','c'])

     a      c  count
4  1.0   blah      2
0  NaN    NaN      1
1  NaN   blah      1
2  1.0  yadda      1
3  1.0    NaN      1

In [14]:
tidy_count(df_combi,['a','b','c'])

     a    b      c  count
3  1.0  1.0   blah      2
0  NaN  1.0   blah      1
1  1.0  2.0  yadda      1
2  1.0  NaN    NaN      1
4  NaN  NaN    NaN      1